Revit 2018 API
Rebar.ComputeDrivingCurves Method
 Compute the driving curves.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().ComputeDrivingCurves() instead.")]
public IList<Curve> ComputeDrivingCurves()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().ComputeDrivingCurves() instead.")> _
Public Function ComputeDrivingCurves As IList(Of Curve)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().ComputeDrivingCurves() instead.")]
public:
IList<Curve^>^ ComputeDrivingCurves()
Return Value
 Returns an empty array if an error is encountered.
Remarks
 The driving curves are the ones that appear in rebar sketch mode. They include lines and arcs that drive the shape, but exclude fillets and hooks. They always lie in a plane-- if the bar is 3D, these curves are a subset or a projection. They are also used for shape matching.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This method applies only to shape driven rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace